![](https://images.velog.io/images/shinwonse/post/5633f8f6-520e-43f0-8bf4-3141fdc014dc/image.png)

## Mock Data?
Mock Data란 가짜 데이터 즉, 샘플 데이터를 뜻한다. 프론트엔드 개발을 하면서 화면에 출력되는 데이터를 디자인 샘플대로 하드코딩하는 것이 아니라 백엔드와 통신하기 전에 미리 데이터가 내가 생각한대로 잘 출력되는지 알 수 있는 방법이 없을까 생각하다가 알게 되었다.

## Mock Data를 관리하는 방법
크게 두가지라고 볼 수 있다. 첫번째는 .js 파일에 data를 담고 그걸 import하는 방법, 두번째는 실제 API에서 보내주는 데이터 형식에 맞춰 json파일에 data를 담아 받아오는 방법이 있다. 여기서 나는 후자를 선택했고 아직 서버를 올리기 전이기 때문에 fetch가 아닌 import로 테스트했다.

![](https://images.velog.io/images/shinwonse/post/623a0541-e406-446b-b523-7f4a99cc4b25/%E1%84%89%E1%85%B3%E1%84%8F%E1%85%B3%E1%84%85%E1%85%B5%E1%86%AB%E1%84%89%E1%85%A3%E1%86%BA%202021-11-13%20%E1%84%8B%E1%85%A9%E1%84%92%E1%85%AE%207.20.28.png)

위와 같이 프로젝트에 mock 폴더를 만들었고 그 아래에 내가 맡아 구현하고 있는 우리 웹페이지의 home화면에 필요한 mock data들을 담을 폴더를 또 하나 만들었다.

그리고는 아래와 같이 recommendationEvents.json 파일을 만들었다. (파일 이름이 너무 긴가... 의미는 명확해보여서 좋은거같은데)

```json
[
    {
        "id": 1,
        "img": "img/건국대2.jpeg",
        "title": "2022 건국대학교 정시 입시설명회",
        "date": "2021-11-11T13:00:00.000Z"
    },
    {
        "id": 2,
        "img": "img/건국대2.jpeg",
        "title": "2022 건국대학교 수시 입시설명회",
        "date": "2021-11-11T13:00:00.000Z"
    },
    {
        "id": 3,
        "img": "img/건국대2.jpeg",
        "title": "2022 건국대학교 정시 입시설명회",
        "date": "2021-11-11T13:00:00.000Z"
    },
    {
        "id": 4,
        "img": "img/건국대2.jpeg",
        "title": "2022 건국대학교 정시 입시설명회",
        "date": "2021-11-11T13:00:00.000Z"
    }
]
```
되게 대충 만들긴했는데... 데이터가 잘 넘어가고 출력되는지 확인하는 것에만 의의를 둔다. 구글링하다보니까 이런 mock data들을 만들어주는 사이트도 있다는데 나중에 그것도 한번 활용해볼 생각이다.

![](https://images.velog.io/images/shinwonse/post/a0bde8d5-6a65-4294-ae1e-c961fee28b24/%E1%84%89%E1%85%B3%E1%84%8F%E1%85%B3%E1%84%85%E1%85%B5%E1%86%AB%E1%84%89%E1%85%A3%E1%86%BA%202021-11-14%20%E1%84%8B%E1%85%A9%E1%84%8C%E1%85%A5%E1%86%AB%2012.16.55.png)

여튼 위와 같이 json 형식의 mock data를 받아와서 사용할 수 있다.

![](https://images.velog.io/images/shinwonse/post/25aef0f7-9dde-468e-a113-d476b20e7b68/%E1%84%89%E1%85%B3%E1%84%8F%E1%85%B3%E1%84%85%E1%85%B5%E1%86%AB%E1%84%89%E1%85%A3%E1%86%BA%202021-11-14%20%E1%84%8B%E1%85%A9%E1%84%8C%E1%85%A5%E1%86%AB%2012.15.27.png)

이건 결과화면!

처음에는 그냥 피그마에 디자인팀에서 그린 자료나 내가 피그마에 만들어둔 샘플을 보고 그대로 하드코딩해서 화면을 구성했다. 그게 끝인줄 알았다. 하지만 그렇게 두면 결국 백엔드랑 맞출때 코드를 전면 수정해야한다는 점. 미리 mock data를 만들어서 테스트해본다면 백엔드팀이랑 소통할 때 훨씬 좋지 않을까?
